////////////////////////////////////////////////////////////////////////////////
// МЕНЕДЖЕР КОНСТАНТЫ ТМС_ПАРАМЕТРЫСЕРВИСАИНТЕГРАЦИИ
//
// Модуль предназначен для управления настройками сервиса интеграции.
// Содержит функции для получения, установки и инициализации параметров
// интеграционного взаимодействия с mock-сервисом.
//
// Copyright (c) 2025 rzateev
// 
// Этот файл является частью проекта 1cServiceIntegrationMock,
// распространяемого под лицензией MIT.
// Подробности см. в файле LICENSE в корне проекта.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
Функция ПолучитьНастройки() Экспорт
	
	ПараметрыСервисаПоУмолчанию = НовыйПараметрыСервисаИнтеграции();
	
	ТекущиеНастройки = ТМС_ОбщегоНазначенияВызовСервера.ПрочитатьЗначениеКонстанты("ТМС_ПараметрыСервисаИнтеграции");
	
	Если ТипЗнч(ТекущиеНастройки) = Тип("ХранилищеЗначения") Тогда
		СтруктураТекущиеНастройки = ТекущиеНастройки.Получить();
		
		Если СтруктураТекущиеНастройки <> Неопределено
			И ТипЗнч(СтруктураТекущиеНастройки) = Тип("Структура") Тогда
			
			Возврат СтруктураТекущиеНастройки
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// Если настроек не было  - сохраняем их и возвращаем значения по-умолчанию
	ТМС_ОбщегоНазначенияВызовСервера.СохранитьЗначениеКонстанты(
		"ТМС_ПараметрыСервисаИнтеграции", Новый ХранилищеЗначения(ПараметрыСервисаПоУмолчанию));			
	Возврат ПараметрыСервисаПоУмолчанию; 
	
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Функция НовыйПараметрыСервисаИнтеграции()
	
	ПараметрыСервисаИнтеграции = Новый Структура;
	ПараметрыСервисаИнтеграции.Вставить("БазовыйURL",БазовыйURLПоУмолчанию());	
	ПараметрыСервисаИнтеграции.Вставить("Логин",ИмяАдминистратораПоУмолчанию());
	ПараметрыСервисаИнтеграции.Вставить("Пароль",ПарольАдминистратораПоУмолчанию());
	
	Возврат ПараметрыСервисаИнтеграции;
	
КонецФункции

Функция БазовыйURLПоУмолчанию()
	
	// Используем локальный адрес для разработки
	ИмяСервера = "localhost";
	Порт = "9090";
	Возврат "http://" + ИмяСервера + ":" + Порт;
	
КонецФункции

// Возвращает имя пользователя администратора по умолчанию.
//
// Возвращаемое значение:
//  Строка - Имя пользователя.
//
Функция ИмяАдминистратораПоУмолчанию()
	Возврат "admin";
КонецФункции

// Возвращает пароль администратора по умолчанию.
//
// Возвращаемое значение:
//  Строка - Пароль.
//
Функция ПарольАдминистратораПоУмолчанию()
	Возврат "admin";
КонецФункции	

#КонецОбласти