////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ КОМАНДЫ ТМС_СЕРВИСЫИНТЕГРАЦИИ
//
// Модуль предназначен для выполнения команд управления сервисами интеграции.
// Содержит обработчики для открытия форм управления и подключения внешних обработок.
//
// Copyright (c) 2025 rzateev
// 
// Этот файл является частью проекта 1cServiceIntegrationMock,
// распространяемого под лицензией MIT.
// Подробности см. в файле LICENSE в корне проекта.
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    ПодключитьВнешнююОбработкуНаСервере();
    ОткрытьФорму("ВнешняяОбработка.StandardIntegrationServicesManagment.Форма");
КонецПроцедуры

&НаСервере
Процедура ПодключитьВнешнююОбработкуНаСервере()
    ВнешниеОбработки.Подключить("v8res://mngbase/StandardIntegrationServicesManagment.epf", "StandardIntegrationServicesManagment", false);
КонецПроцедуры

#КонецОбласти